---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Vertex Properties
Vertex Class See Also Send Feedback
---

The Vertex type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

Vertex Class

Autodesk.Revit.DB.DirectContext3D Namespace